Revit 2026 API

# ConnectorAssignedPipeLossMethod Property

---

The pipe loss method of the connector.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public PipeLossMethodType AssignedPipeLossMethod { get; }
```
```vb
Public ReadOnly Property AssignedPipeLossMethod As PipeLossMethodType
	Get
```
```cpp
public:
property PipeLossMethodType AssignedPipeLossMethod {
	PipeLossMethodType get ();
}
```
```fsharp
member AssignedPipeLossMethod : PipeLossMethodType with get
```

#### Property Value

PipeLossMethodType

| Exception | Condition |
| --- | --- |
| InvalidOperationException | Thrown when the connector's domain is not DomainPiping. Thrown when the connector is not in a family instance. |
| InvalidOperationException | Thrown on failure to get pipe loss method. |

Assigned duct pipe loss method may be assigned for connectors of some family instances.

#### Reference

Connector Class

Autodesk.Revit.DB Namespace